Tekla Open API Reference for Tekla Structures 2025
BooleanOperatorType Enumeration
 The Boolean operator type defines the operators between two Boolean filter expressions.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BooleanOperatorType
Public Enumeration BooleanOperatorType
Members
Member name | Value | Description
IS_EQUAL | 1 |  The "is equal" operator.
IS_NOT_EQUAL | 2 |  The "is not equal" operator.
BOOLEAN_OR | 3 |  The Boolean OR operator.
BOOLEAN_AND | 4 |  The Boolean AND operator.
See Also
Reference
Tekla.Structures.Filtering Namespace